{
    "Pages": {
        "Home": {
            "Title": "Поездки на ваш выбор по низким ценам",
            "Subtitle": "Находите пассажиров или становитесь водителем с",
            "Trips": "Поездки",
            "Drivers": "Водители",
            "Rating": "Рейтинг",
            "Support": "Поддержка"
        },
        "About": {
            "heroTitle": "О нас",
            "missionQuote": "Мы делаем междугородние путешествия доступными, безопасными и человечными для каждого жителя Узбекистана",
            "missionAuthor": "— Миссия Yo'ldosh",
            "introText": "Yo'ldosh — это первая в Узбекистане платформа райдшеринга для междугородних поездок, которая объединяет водителей и пассажиров, путешествующих по одному маршруту. Мы используем современные технологии, чтобы заполнять пустые места в автомобилях и делать поездки между городами экономичнее и комфортнее. Yo'ldosh создает доверительное сообщество попутчиков, где каждая поездка — это не только экономия, но и возможность познакомиться с интересными людьми и безопасно добраться до цели.",
            "originTitle": "С чего всё началось",
            "originText1": "В 2024 году наш основатель столкнулся с типичной для Узбекистана проблемой: нужно было срочно добраться из Ташкента в Андижан, но все билеты на поезд были распроданы, а такси стоило слишком дорого. Он начал искать попутчиков через Telegram-группы и понял, насколько это неудобно и небезопасно.",
            "originText2": "Публикация личного номера телефона в открытом чате, десятки звонков от незнакомых людей, часы переговоров о цене, полное отсутствие информации о том, кто будет за рулем — все это заставило задуматься: почему в эпоху современных технологий мы до сих пор ищем попутчиков как в 90-е годы?",
            "originHighlight": "И тогда пришла идея: создать централизованную платформу, где люди смогут безопасно находить попутчиков, не раскрывая личные контакты, с прозрачными ценами и системой рейтингов. Так родился Yo'ldosh.",
            "originText3": "На узбекском языке \"yo'ldosh\" означает \"попутчик\" — человек, с которым ты делишь дорогу. Это слово идеально отражает философию нашего сервиса: не просто перевозка из точки А в точку Б, а совместное путешествие, где люди поддерживают друг друга.",
            "originText4": "За следующий год мы изучили опыт международных платформ райдшеринга, таких как BlaBlaCar, и адаптировали лучшие практики к реалиям узбекистанского рынка. Мы разработали систему автоматической верификации водителей с использованием OCR, создали защищенный чат с AI-модерацией, чтобы защитить контакты пользователей, и построили справедливую систему разрешения споров.",
            "originText5": "Сегодня Yo'ldosh готов изменить культуру междугородних перевозок в Узбекистане. Мы создаем не просто сервис, а движение — сообщество людей, которые выбирают удобство, безопасность и взаимопомощь вместо хаоса и неопределенности.",
            "statsTitle": "Наши цифры",
            "stats": [
                {
                    "title": "15+",
                    "description": "Городов Узбекистана в нашей сети"
                },
                {
                    "title": "50%",
                    "description": "Экономия по сравнению с такси"
                },
                {
                    "title": "24/7",
                    "description": "Поддержка пользователей"
                },
                {
                    "title": "300км+",
                    "description": "Средняя дистанция поездки"
                },
                {
                    "title": "100%",
                    "description": "Верификация всех водителей"
                },
                {
                    "title": "12мес",
                    "description": "Можно бронировать заранее"
                }
            ],
            "impactTitle": "Хотите узнать, как мы меняем Узбекистан?",
            "impactText": "Yo'ldosh не просто экономит деньги пользователей — мы меняем саму культуру междугородних перевозок, делая их безопаснее, удобнее и человечнее. Вот как мы это делаем:",
            "cards": [
                {
                    "title": "Безопасность превыше всего",
                    "description": "Каждый водитель проходит автоматическую верификацию документов с использованием технологий OCR. Система проверяет ПИНФЛ, категории прав, VIN автомобиля и соответствие данных в документах. Только после успешной проверки водитель получает возможность публиковать поездки."
                },
                {
                    "title": "Создаем сообщество доверия",
                    "description": "Карпулинг создает уникальные условия: люди, которые вряд ли бы когда-нибудь встретились, выходят на контакт и отправляются вместе в дорогу. Наша система рейтингов и отзывов помогает строить доверие между незнакомыми людьми и формировать культуру взаимопомощи на дорогах Узбекистана."
                },
                {
                    "title": "Делаем поездки доступными",
                    "description": "Разделяя расходы на топливо между попутчиками, мы снижаем стоимость междугородних поездок в среднем на 50% по сравнению с такси. Это делает путешествия между городами доступными для студентов, молодых семей и всех, кто ценит разумную экономию."
                },
                {
                    "title": "Защищаем конфиденциальность",
                    "description": "Наш встроенный чат с AI-модерацией категорически запрещает обмен контактными данными. Ваш номер телефона остается в безопасности, а все общение происходит через защищенную платформу."
                },
                {
                    "title": "Справедливость для всех",
                    "description": "Наша независимая система разрешения споров обеспечивает справедливое рассмотрение конфликтов. Каждый имеет право на апелляцию и честное разбирательство."
                },
                {
                    "title": "Инновации для удобства",
                    "description": "Мы постоянно внедряем новые технологии: от автоматического распознавания документов до умных алгоритмов подбора попутчиков. В планах — интеграция платежей картой, страхование поездок и расширение на всю Центральную Азию."
                }
            ]
        },
        "HowItWorks": {
            "Title": "Разделите расходы с попутчиками и сэкономьте",
            "Subtitle": "Предлагайте поездки как водитель и экономьте, заполняя свой автомобильно попутчиками. Всё просто: опубликуйте свою поездку, и пассажиры разделят с вами расходы на топливо и дорожные сборы.",
            "Share": "Поделиться с поездкой",
            "Features": {
                "1": {
                    "Title": "Идеальная поездка по правильной цене",
                    "Description": "Выбирайте из множества недорогих поездок, которые идеально подходят под ваше расписание и бюджет."
                },
                "2": {
                    "Title": "Доверяйте тем, с кем едете",
                    "Description": "Все водители проходят проверку паспорта и профиля, поэтому поездки безопасны и без лишних переживаний."
                },
                "3": {
                    "Title": "Листайте, кликайте и в путь!",
                    "Description": "Забронировать поездку можно за секунды в нашем простом и быстром приложении."
                },
                "Button": "Подробнее"
            }
        },
        "Help": {
            "Title": "Помогите нам защитить вас от мошенников",
            "Subtitle": "В Yo'ldosh мы делаем всё, чтобы ваши поездки были безопасными. Но иногда мошенники пытаются воспользоваться доверием пользователей.",
            "Protect": {
                "Title": "Чтобы защитить себя:",
                "1": "Общайтесь и оплачивайте поездки только через приложение Yo'ldosh.",
                "2": "Не передавайте никому SMS-коды, PIN-коды и данные банковских карт.",
                "3": "Проверяйте рейтинг и отзывы водителей и пассажиров.",
                "4": "Если заметили что-то подозрительное — сообщите нам, разберёмся мгновенно."
            },
            "Security": "Безопасность — наша общая ответственность.",
            "BeCareful": "Будьте внимательны, и каждая поездка с Yo'ldosh будет спокойной и надёжной."
        },
        "WhyUs": {
            "Title": "Почему выбирают нас",
            "Subtitle": "Ваш надёжный спутник в междугороднем райдшеринге по всему Узбекистану.",
            "Cards": {
                "title1": "Надёжность",
                "description1": "Мы проверяем каждого водителя и пассажира, чтобы ваша поездка была безопасной и без забот.",
                "title2": "Скорость",
                "description2": "Находите поездку и бронируйте место за секунды. Никаких долгих ожиданий.",
                "title3": "Прозрачные цены",
                "description3": "Никаких скрытых платежей — вы всегда точно знаете, за что платите.",
                "title4": "Комфорт",
                "description4": "Выбирайте поездки под свои предпочтения и путешествуйте с удобством.",
                "title5": "Сообщество",
                "description5": "Присоединяйтесь к дружному сообществу водителей и пассажиров, которые едут по вашему маршруту.",
                "title6": "Поддержка 24/7",
                "description6": "Наша служба поддержки всегда готова помочь, в любое время и любой день.",
                "title7": "Гибкость",
                "description7": "Планируйте поездки по своему графику — бронируйте, меняйте или отменяйте легко.",
                "title8": "Экологичность",
                "description8": "Сокращайте углеродный след, деля поездку вместо того, чтобы ехать одному."
            }
        },
        "Popular": {
            "Title": "Популярные маршруты среди наших пользователей",
            "From": "От",
            "Sum": "сум",
            "Andijan": "Андижан",
            "Fergana": "Фергана",
            "Namangan": "Наманган",
            "Tashkent": "Ташкент",
            "Bukhara": "Бухара",
            "Jizzah": "Джизак",
            "Navoiy": "Навои",
            "Samarkand": "Самарканд",
            "Sirdarya": "Сырдарья",
            "Xorezm": "Хорезм",
            "Nukus": "Нукус"
        },
        "Travel": {
            "Title": "Путешествуйте удобнее с приложением Yo'ldosh",
            "Description": "Установите мобильное приложение Yo'ldosh, чтобы находить пассажиров. С ним вы всегда будете в курсе своих поездок. Общайтесь с пассажирами, получайте напоминания о поездках, смотрите купленные билеты и пользуйтесь другими полезными функциями прямо со смартфона.",
            "Subtitle": "С приложением Yo'ldosh история ваших поездок всегда под рукой!",
            "AppStore": "Загрузить в App Store",
            "GooglePlay": "Загрузить в Google Play"
        },
        "Trips": {
            "Title": "Поездки",
            "PopularTrips": "Популярные поездки",
            "Found": "поездок найдено",
            "From": "Откуда",
            "NotFound": "Поездки не найдены",
            "Error": "Ошибка загрузки поездок. Попробуйте ещё раз.",
            "Details": {
                "Back": "Назад",
                "Title": "Детали поездки",
                "Description": "Ознакомьтесь с информацией о поездке перед бронированием",
                "Route": "Маршрут",
                "Information": "Информация о поездке",
                "Departure": "Отправление",
                "Seats": "Свободных мест",
                "Driver": "Водитель",
                "Passengers": "Пассажиры",
                "Vehicle": "Автомобиль",
                "AdditionalInformation": "Комментарии водителя",
                "Price": "Цена за человека",
                "Book": "Забронировать",
                "Distance": "Дистанция",
                "Duration": "Длительность",
                "Hours": "ч",
                "Minutes": "м",
                "Preferences": {
                    "Title": "Предпочтения",
                    "Smoking": "Курение",
                    "Door": "Забрать от двери",
                    "Food": "Остановки на еду",
                    "AC": "Кондиционер",
                    "Pets": "Животные",
                    "Garage": "Багаж",
                    "Yes": "Да",
                    "No": "Нет",
                    "Empty": "Пустой",
                    "HalfEmpty": "Полупустой",
                    "Full": "Полный"
                }
            },
            "Preferences": {
                "Title": "Предпочтения",
                "Smoking": "Курение",
                "Door": "Забрать от двери",
                "Food": "Остановка для перекуса",
                "Pets": "Животные",
                "Garage": "Багаж",
                "Yes": "Да",
                "No": "Нет"
            },
            "ResetFilters": "Сбросить фильтры",
            "NotFoundTitle": "Попробуйте изменить дату или параметры фильтров, чтобы найти подходящую поездку."
        },
        "NotFound": {
            "Title": "Ничего не найдено",
            "Description": "Не удалось найти запрашиваемый ресурс",
            "Button": "Назад в главную",
            "RequestError": "Сообщить об ошибке"
        },
        "PublicOffer": {
            "title": "ПУБЛИЧНАЯ ОФЕРТА",
            "subtitle": "на оказание услуг по предоставлению доступа к платформе Yo'ldosh",
            "date": "«5» Январь 2026 г.",
            "city": "г. Ташкент",
            "intro": "ООО 'MILLIY YOLDOSH', именуемое в дальнейшем «Исполнитель», в лице директора, действующего на основании Устава, публикует настоящую Публичную оферту о заключении Договора на оказание услуг по предоставлению доступа к платформе Yo'ldosh.",
            "terms": {
                "title": "1. ТЕРМИНЫ И ОПРЕДЕЛЕНИЯ",
                "1": "1.1 Публичная оферта (далее – «Оферта») – публичное предложение Исполнителя, адресованное неопределенному кругу лиц, заключить Договор на условиях, изложенных в настоящей Оферте.",
                "2": "1.2 Акцепт Оферты – полное и безоговорочное принятие Оферты путем осуществления действий, указанных в пункте 3.2 настоящей Оферты.",
                "3": "1.3 Пользователь – физическое лицо, достигшее 18 лет, заключившее с Исполнителем Договор на условиях, содержащихся в настоящей Оферте.",
                "4": "1.4 Платформа (Приложение) – программное обеспечение «Yo'ldosh», доступное для загрузки и использования на мобильных устройствах, предназначенное для организации совместных поездок между Водителями и Пассажирами.",
                "5": "1.5 Водитель – Пользователь, прошедший верификацию и получивший право публиковать информацию о поездках в Приложении.",
                "6": "1.6 Пассажир – Пользователь, использующий Приложение для поиска и бронирования поездок.",
                "7": "1.7 Поездка – совместная поездка на автомобиле Водителя по маршруту, опубликованному Водителем в Приложении.",
                "8": "1.8 Верификация – процедура проверки документов Водителя (водительское удостоверение, технический паспорт автомобиля) автоматизированной системой Исполнителя.",
                "9": "1.9 Комиссия Сервиса – вознаграждение Исполнителя за предоставление доступа к Платформе, размер которого определяется в соответствии с разделом 5 настоящей Оферты."
            },
            "subject": {
                "title": "2. ПРЕДМЕТ ДОГОВОРА",
                "1": "2.1 Исполнитель обязуется предоставить Пользователю доступ к функционалу Платформы для организации совместных поездок, а Пользователь обязуется использовать Платформу в соответствии с условиями настоящей Оферты и оплачивать Комиссию Сервиса в порядке и на условиях, предусмотренных настоящей Офертой.",
                "2": "2.2 Исполнитель предоставляет технологическую платформу, обеспечивающую взаимодействие между Водителями и Пассажирами. Исполнитель не является перевозчиком и не оказывает услуг по перевозке пассажиров.",
                "3": "2.3 Договор на оказание транспортных услуг заключается непосредственно между Водителем и Пассажиром. Ответственность за надлежащее исполнение обязательств по перевозке несет Водитель."
            },
            "acceptance": {
                "title": "3. ПОРЯДОК АКЦЕПТА ОФЕРТЫ",
                "1": "3.1 Акцепт настоящей Оферты означает полное и безоговорочное принятие всех условий Оферты без каких-либо изъятий и ограничений.",
                "2": "3.2 Акцептом настоящей Оферты является совершение Пользователем следующих действий:",
                "2_1": "3.2.1 Ввод номера телефона в Приложении;",
                "2_2": "3.2.2 Подтверждение номера телефона путем ввода одноразового кода (OTP-код), полученного посредством SMS-сообщения.",
                "3": "3.3 Моментом акцепта Оферты и заключения Договора считается момент успешного ввода OTP-кода и получения доступа к функционалу Приложения.",
                "4": "3.4 Совершая акцепт настоящей Оферты, Пользователь подтверждает, что:",
                "4_1": "3.4.1. достиг 18-летнего возраста;",
                "4_2": "3.4.2 полностью ознакомлен с условиями настоящей Оферты;",
                "4_3": "3.4.3 полностью понимает предмет Договора;",
                "4_4": "3.4.4 полностью понимает значение и последствия своих действий в отношении заключения и исполнения Договора."
            },
            "rights": {
                "title": "4. ПРАВА И ОБЯЗАННОСТИ СТОРОН",
                "executorObliges": "4.1 Исполнитель обязуется:",
                "executorObliges1": "4.1.1 Обеспечить функционирование Платформы и доступ Пользователей к ее функционалу 24/7, за исключением времени проведения профилактических и ремонтных работ.",
                "executorObliges2": "4.1.2 Обеспечить конфиденциальность персональных данных Пользователей в соответствии с Политикой конфиденциальности и законодательством Республики Узбекистан.",
                "executorObliges3": "4.1.3 Осуществлять верификацию документов Водителей посредством автоматизированной системы.",
                "executorObliges4": "4.1.4 Предоставить встроенный чат для коммуникации между Водителями и Пассажирами.",
                "executorObliges5": "4.1.5 Уведомлять Пользователей об изменениях условий настоящей Оферты путем публикации новой редакции в Приложении.",
                "executorRights": "4.2 Исполнитель имеет право:",
                "executorRights1": "4.2.1 Изменять условия настоящей Оферты в одностороннем порядке, уведомив Пользователей путем публикации новой редакции в Приложении не менее чем за 7 (семь) календарных дней до вступления изменений в силу.",
                "executorRights2": "4.2.2 Приостанавливать или прекращать доступ Пользователя к Платформе в случае нарушения им условий настоящей Оферты.",
                "executorRights3": "4.2.3 Блокировать учетную запись Пользователя без предварительного уведомления в случаях, предусмотренных разделом 6 настоящей Оферты.",
                "executorRights4": "4.2.4 Устанавливать и изменять размер Комиссии Сервиса, уведомив Пользователей не менее чем за 14 (четырнадцать) календарных дней до ввeдения изменений.",
                "executorRights5": "4.2.5 Проводить профилактические работы, которые могут повлечь временную недоступность Платформы, предварительно уведомив Пользователей через Приложение.",
                "userPassengerObliges": "4.3 Пользователь (Пассажир) обязуется:",
                "userPassengerObliges1": "4.3.1 Предоставлять достоверную информацию при регистрации (имя, фамилия, номер телефона).",
                "userPassengerObliges2": "4.3.2 Своевременно бронировать поездки и уведомлять Водителя об отмене бронирования.",
                "userPassengerObliges3": "4.3.3 Соблюдать правила поведения во время поездки и уважительно относиться к Водителю и другим Пассажирам.",
                "userPassengerObliges4": "4.3.4 Осуществлять все коммуникации с Водителем исключительно через встроенный чат Приложения.",
                "userPassengerObliges5": "4.3.5 Не распространять контактные данные (номера телефонов, аккаунты в мессенджерах и социальных сетях) с целью обхода Платформы.",
                "userDriverObliges": "4.4 Пользователь (Водитель) обязуется:",
                "userDriverObliges1": "4.4.1 Пройти процедуру верификации, предоставив достоверную информацию и копии следующих документов: водительское удостоверение (с информацией о ПИНФЛ и категории прав); технический паспорт транспортного средства.",
                "userDriverObliges2": "4.4.2 Обеспечить безопасность перевозки Пассажиров, соблюдать Правила дорожного движения Республики Узбекистан.",
                "userDriverObliges3": "4.4.3 Содержать автомобиль в технически исправном состоянии.",
                "userDriverObliges4": "4.4.4 Публиковать в Приложении только достоверную информацию о поездках (маршрут, дата, время, цена, количество свободных мест).",
                "userDriverObliges5": "4.4.5 Своевременно обновлять статус поездки («Начать поездку», «Завершить поездку»).",
                "userDriverObliges6": "4.4.6 Своевременно оплачивать Комиссию Сервиса в порядке, предусмотренном разделом 5 настоящей Оферты.",
                "userDriverObliges7": "4.4.7 Осуществлять все коммуникации с Пассажирами исключительно через встроенный чат Приложения.",
                "userDriverObliges8": "4.4.8 Не распространять контактные данные (номера телефонов, аккаунты в мессенджерах и социальных сетях) с целью обхода Платформы.",
                "userDriverObliges9": "4.4.9 Иметь действующий полис обязательного страхования гражданской ответственности владельца транспортного средства.",
                "userRights": "4.5 Пользователь имеет право:",
                "userRights1": "4.5.1 Использовать функционал Платформы в соответствии с настоящей Офертой.",
                "userRights2": "4.5.2 Получать техническую поддержку от Исполнителя.",
                "userRights3": "4.5.3 В любое время прекратить использование Платформы и удалить свою учетную запись."
            },
            "pricing": {
                "title": "5. СТОИМОСТЬ УСЛУГ И ПОРЯДОК РАСЧЕТОВ",
                "1": "5.1 Регистрация в Приложении и получение роли Пассажира является бесплатной.",
                "2": "5.2 Верификация Водителя и получение доступа к публикации поездок является бесплатной.",
                "3": "5.3 На начальном этапе работы Платформы Исполнитель предоставляет Водителям бескомиссионный период, в течение которого Комиссия Сервиса не взимается. Продолжительность бескомиссионного периода определяется Исполнителем и может варьироваться для разных Водителей.",
                "4": "5.4 По окончании бескомиссионного периода Исполнитель вводит Комиссию Сервиса, которая взимается с Водителя за каждую завершенную поездку.",
                "5": "5.5 Размер Комиссии Сервиса определяется Исполнителем и публикуется в Приложении. Исполнитель уведомляет Водителей об установлении или изменении размера Комиссии не менее чем за 14 (четырнадцать) календарных дней до вступления изменений в силу.",
                "6": "5.6 Комиссия Сервиса автоматически списывается с баланса Водителя в Приложении после нажатия кнопки «Завершить поездку».",
                "7": "5.7 Водитель обязан поддерживать положительный баланс в Приложении для оплаты Комиссии Сервиса. Пополнение баланса осуществляется способами, доступными в Приложении.",
                "8": "5.8 В случае недостаточности средств на балансе Водителя для оплаты Комиссии Сервиса, задолженность фиксируется в системе. Водитель обязан погасить задолженность в течение 3 (трех) календарных дней. До момента погашения задолженности Водитель не может публиковать новые поездки.",
                "9": "5.9 Расчеты между Водителем и Пассажиром за транспортные услуги производятся напрямую между ними и не проходят через Платформу. Исполнитель не является стороной договора перевозки и не несет ответственности за расчеты между Водителем и Пассажиром."
            },
            "liability": {
                "title": "6. ПРАВИЛА ИСПОЛЬЗОВАНИЯ ПЛАТФОРМЫ И ОТВЕТСТВЕННОСТЬ",
                "1": "6.1 Пользователям КАТЕГОРИЧЕСКИ ЗАПРЕЩАЕТСЯ:",
                "1_1": "6.1.1 Обмениваться номерами телефонов, аккаунтами в мессенджерах (WhatsApp, Telegram и др.) или социальных сетях с целью организации поездок в обход Платформы.",
                "1_2": "6.1.2 Осуществлять коммуникацию с другими Пользователями вне встроенного чата Приложения до или во время организации поездки через Платформу.",
                "1_3": "6.1.3 Публиковать недостоверную, ложную или вводящую в заблуждение информацию.",
                "1_4": "6.1.4 Использовать Платформу в незаконных целях или способами, нарушающими права третьих лиц.",
                "1_5": "6.1.5 Пытаться получить несанкционированный доступ к Платформе, серверам или базам данных Исполнителя.",
                "1_6": "6.1.6 Использовать автоматизированные средства (ботов, скрипты) для взаимодействия с Платформой без письменного согласия Исполнителя.",
                "1_7": "6.1.7 Размещать в чате и профиле информацию, содержащую угрозы, оскорбления, дискриминацию, нецензурную лексику, материалы сексуального или порнографического характера.",
                "1_8": "6.1.8 Передавать третьим лицам доступ к своей учетной записи.",
                "2": "6.2 В случае нарушения Пользователем положений пункта 6.1 настоящей Оферты, Исполнитель имеет право:",
                "2_1": "6.2.1 Направить Пользователю предупреждение.",
                "2_2": "6.2.2 Временно приостановить доступ к учетной записи на срок от 7 до 30 дней.",
                "2_3": "6.2.3 Заблокировать учетную запись Пользователя без возможности восстановления.",
                "3": "6.3 Решение о применении меры ответственности принимается Исполнителем самостоятельно с учетом характера и тяжести нарушения.",
                "4": "6.4 При повторных нарушениях правил, указанных в пунктах 6.1.1 и 6.1.2 (обмен контактами, выход на связь вне Платформы), учетная запись блокируется без предупреждения и права на восстановление.",
                "5": "6.5 Водитель несет полную ответственность за: безопасность перевозки Пассажиров; техническое состояние транспортного средства; соблюдение Правил дорожного движения; наличие действующих документов на право управления транспортным средством и на само транспортное средство; причинение вреда жизни, здоровью или имуществу Пассажиров и третьих лиц во время поездки.",
                "6": "6.6 Исполнитель не несет ответственности за: действия или бездействие Водителей и Пассажиров; качество услуг по перевозке, оказываемых Водителями; ущерб, причиненный Пользователям в результате взаимодействия друг с другом; утрату или повреждение имущества Пользователей во время поездки; конфликты и споры между Водителями и Пассажирами; временную недоступность Платформы в связи с профилактическими работами или техническими сбоями.",
                "7": "6.7 Пользователь самостоятельно оценивает риски использования Платформы и принимает решение о целесообразности взаимодействия с другими Пользователями."
            },
            "privacy": {
                "title": "7. КОНФИДЕНЦИАЛЬНОСТЬ И ПЕРСОНАЛЬНЫЕ ДАННЫЕ",
                "1": "7.1 Обработка персональных данных Пользователей осуществляется в соответствии с Политикой конфиденциальности Платформы Yo'ldosh и законодательством Республики Узбекистан о персональных данных.",
                "2": "7.2 Регистрируясь в Приложении, Пользователь дает согласие на обработку своих персональных данных в целях предоставления доступа к Платформе и ее функционалу.",
                "3": "7.3 Исполнитель обязуется не передавать персональные данные Пользователей третьим лицам, за исключением случаев, предусмотренных законодательством Республики Узбекистан или Политикой конфиденциальности."
            },
            "disputes": {
                "title": "8. РАЗРЕШЕНИЕ СПОРОВ",
                "1": "8.1 Все споры и разногласия, возникающие из настоящего Договора или в связи с ним, разрешаются путем переговоров между Сторонами.",
                "2": "8.2 В случае невозможности разрешения спора путем переговоров, спор подлежит рассмотрению в судебном порядке в соответствии с законодательством Республики Узбекистан.",
                "3": "8.3 Претензионный порядок разрешения спора является обязательным. Срок рассмотрения претензии составляет 10 (десять) рабочих дней с момента ее получения.",
                "4": "8.4 Претензии направляются Исполнителю через функционал обратной связи в Приложении или по электронной почте, указанной в разделе 10 настоящей Оферты."
            },
            "termination": {
                "title": "9. СРОК ДЕЙСТВИЯ ДОГОВОРА И ПОРЯДОК РАСТОРЖЕНИЯ",
                "1": "9.1 Договор вступает в силу с момента его акцепта Пользователем и действует бессрочно.",
                "2": "9.2 Пользователь вправе в любое время расторгнуть Договор в одностороннем порядке путем удаления своей учетной записи в Приложении.",
                "3": "9.3 Исполнитель вправе расторгнуть Договор в одностороннем порядке в случае нарушения Пользователем условий настоящей Оферты, заблокировав учетную запись Пользователя.",
                "4": "9.4 Расторжение Договора не освобождает Стороны от ответственности за нарушения, допущенные в период его действия.",
                "5": "9.5 При расторжении Договора Водитель обязан погасить имеющуюся задолженность по Комиссии Сервиса в течение 5 (пяти) календарных дней."
            },
            "final": {
                "title": "10. ЗАКЛЮЧИТЕЛЬНЫЕ ПОЛОЖЕНИЯ",
                "1": "10.1 Настоящая Оферта составлена в соответствии с законодательством Республики Узбекистан.",
                "2": "10.2 Если какое-либо положение настоящей Оферты будет признано недействительным, это не влечет недействительности остальных положений.",
                "3": "10.3 Исполнитель оставляет за собой право вносить изменения в настоящую Оферту. Новая редакция Оферты вступает в силу с момента ее размещения в Приложении, если иное не предусмотрено новой редакцией Оферты.",
                "4": "10.4 Продолжение использования Платформы после вступления в силу новой редакции Оферты означает согласие Пользователя с внесенными изменениями.",
                "5": "10.5 Все уведомления, связанные с исполнением настоящего Договора, направляются Пользователям через Приложение (push-уведомления, сообщения в Приложении) или на номер телефона, указанный при регистрации.",
                "6": "10.6 Текст настоящей Оферты доступен в Приложении и по адресу: www.yoldosh.uz"
            },
            "requisites": {
                "title": "РЕКВИЗИТЫ ИСПОЛНИТЕЛЯ",
                "company": "ООО 'MILLIY YOLDOSH'",
                "address": "Юридический адрес: Фаровон МФЙ, БУШ 'НУРАФШОН-2' кучаси, 3-уй",
                "inn": "ИНН: 312381612",
                "account": "Расчетный счет: 20208000007298685001",
                "bank": "Банк: АКБ «Микрокредитбанк»",
                "mfo": "МФО: 00433",
                "phone": "Телефон: +998911366444",
                "email": "Электронная почта: info@yoldosh.uz",
                "director": "Директор ООО 'MILLIY YOLDOSH' Ханапияев Б.Ф."
            }
        },
        "PrivacyPolicy": {
            "title": "ПОЛИТИКА КОНФИДЕНЦИАЛЬНОСТИ",
            "subtitle": "Приложения Yo'ldosh",
            "effectiveDate": "Дата вступления в силу: 13.01.2026",
            "lastUpdate": "Последнее обновление: 13.01.2026",
            "general": {
                "title": "1. ОБЩИЕ ПОЛОЖЕНИЯ",
                "1": "1.1. Настоящая Политика конфиденциальности (далее – «Политика») определяет порядок обработки и защиты персональных данных пользователей мобильного приложения «Yo'ldosh» (далее – «Приложение», «Платформа»).",
                "2": "1.2. Оператором персональных данных является ООО \"MILLIY YOLDOSH\" (далее – «Оператор», «Мы»), зарегистрированное в соответствии с законодательством Республики Узбекистан.",
                "3": "1.3. Настоящая Политика разработана в соответствии с:",
                "3_1": "Законом Республики Узбекистан «О персональных данных» от 02.07.2019 г. № ЗРУ-547;",
                "3_2": "Постановлением Кабинета Министров Республики Узбекистан «О мерах по совершенствованию порядка обработки персональных данных» от 10.02.2020 г. № 82;",
                "3_3": "иными нормативными правовыми актами Республики Узбекистан.",
                "4": "1.4. Использование Приложения означает безоговорочное согласие Пользователя с настоящей Политикой и указанными в ней условиями обработки его персональных данных. В случае несогласия с условиями Политики Пользователь должен прекратить использование Приложения.",
                "5": "1.5. Настоящая Политика применяется только к Приложению Yo'ldosh. Мы не контролируем и не несем ответственности за сайты и сервисы третьих лиц, на которые Пользователь может перейти по ссылкам, доступным в Приложении.",
                "6": "1.6. Оператор проверяет актуальность персональных данных и в случае выявления неточностей принимает меры по их обновлению или удалению, если иное не предусмотрено законодательством Республики Узбекистан."
            },
            "definitions": {
                "title": "2. ТЕРМИНЫ И ОПРЕДЕЛЕНИЯ",
                "intro": "2.1. В настоящей Политике используются следующие термины:",
                "1": "Персональные данные – любая информация, относящаяся к прямо или косвенно определенному или определяемому физическому лицу (субъекту персональных данных).",
                "2": "Обработка персональных данных – любое действие или совокупность действий, совершаемых с персональными данными, включая сбор, запись, систематизацию, накопление, хранение, уточнение (обновление, изменение), извлечение, использование, передачу (распространение, предоставление, доступ), обезличивание, блокирование, удаление, уничтожение персональных данных.",
                "3": "Конфиденциальность персональных данных – обязательное для соблюдения Оператором или иным лицом, получившим доступ к персональным данным, требование не допускать их распространения без согласия субъекта персональных данных или наличия иного законного основания.",
                "4": "Пользователь – лицо, имеющее доступ к Приложению посредством сети Интернет и использующее Приложение.",
                "5": "Пассажир – Пользователь, использующий Приложение для поиска и бронирования поездок.",
                "6": "Водитель – Пользователь, прошедший верификацию и использующий Приложение для публикации информации о поездках.",
                "7": "Cookies – небольшие файлы, которые сохраняются на устройстве Пользователя и содержат информацию о предыдущих посещениях и действиях в Приложении."
            },
            "collection": {
                "title": "3. КАКИЕ ПЕРСОНАЛЬНЫЕ ДАННЫЕ МЫ СОБИРАЕМ",
                "1": "3.1. Данные, собираемые от всех Пользователей при регистрации:",
                "1_list": [
                    "Номер мобильного телефона",
                    "Имя",
                    "Фамилия"
                ],
                "2": "3.2. Дополнительные данные, собираемые от Водителей при прохождении верификации:",
                "2_1": "Копия водительского удостоверения, включая:",
                "2_1_list": [
                    "Фотография водительского удостоверения",
                    "Серия и номер водительского удостоверения",
                    "Категория водительских прав",
                    "Дата выдачи и срок действия",
                    "ПИНФЛ (персональный идентификационный номер физического лица)",
                    "Дата рождения",
                    "Место выдачи документа"
                ],
                "2_2": "Копия технического паспорта транспортного средства, включая:",
                "2_2_list": [
                    "Фотография технического паспорта",
                    "Государственный регистрационный номер автомобиля",
                    "Марка, модель, год выпуска транспортного средства",
                    "VIN-номер (идентификационный номер транспортного средства)",
                    "Данные о собственнике транспортного средства"
                ],
                "3": "3.3. Данные, собираемые автоматически при использовании Приложения:",
                "3_list": [
                    "Информация о поездках (маршрут, дата, время начала и окончания поездки, стоимость)",
                    "История бронирований",
                    "Данные о геолокации (при использовании функций навигации и определения местоположения)",
                    "История сообщений во встроенном чате",
                    "IP-адрес",
                    "Тип устройства, операционная система, версия Приложения",
                    "Уникальный идентификатор устройства",
                    "Данные о взаимодействии с Приложением (просмотренные страницы, время использования, клики)",
                    "Информация о балансе Водителя и истории транзакций (списание комиссии)",
                    "Cookies и аналогичные технологии отслеживания"
                ],
                "4": "3.4. Данные, предоставляемые Пользователями добровольно:",
                "4_list": [
                    "Фотография профиля (опционально)",
                    "Дополнительная контактная информация (опционально)",
                    "Отзывы и рейтинги других Пользователей",
                    "Обращения в службу поддержки"
                ]
            },
            "purposes": {
                "title": "4. ЦЕЛИ ОБРАБОТКИ ПЕРСОНАЛЬНЫХ ДАННЫХ",
                "intro": "4.1. Мы собираем и обрабатываем персональные данные Пользователей в следующих целях:",
                "1": "4.2. Предоставление доступа к Платформе:",
                "1_list": [
                    "Регистрация и идентификация Пользователей",
                    "Создание и управление учетной записью",
                    "Обеспечение функционирования Приложения"
                ],
                "2": "4.3. Верификация Водителей:",
                "2_list": [
                    "Проверка подлинности документов (водительское удостоверение, технический паспорт)",
                    "Подтверждение права на управление транспортным средством",
                    "Обеспечение безопасности Пассажиров",
                    "Соблюдение законодательства о перевозках"
                ],
                "3": "4.4. Организация поездок:",
                "3_list": [
                    "Публикация информации о поездках",
                    "Поиск и бронирование поездок",
                    "Обеспечение коммуникации между Водителями и Пассажирами через встроенный чат",
                    "Уведомление о статусе поездки"
                ],
                "4": "4.5. Финансовые операции:",
                "4_list": [
                    "Расчет и списание комиссии Сервиса с Водителей",
                    "Учет транзакций и управление балансом Водителей",
                    "Формирование финансовой отчетности"
                ],
                "5": "4.6. Обеспечение безопасности:",
                "5_list": [
                    "Предотвращение мошенничества и злоупотреблений",
                    "Выявление нарушений Публичной оферты",
                    "Разрешение споров между Пользователями",
                    "Расследование инцидентов"
                ],
                "6": "4.7. Улучшение качества услуг:",
                "6_list": [
                    "Анализ использования Приложения",
                    "Разработка новых функций и услуг",
                    "Персонализация пользовательского опыта",
                    "Оптимизация маршрутов и алгоритмов поиска"
                ],
                "7": "4.8. Связь с Пользователями:",
                "7_list": [
                    "Отправка уведомлений о поездках",
                    "Информирование об изменениях в Приложении",
                    "Техническая поддержка",
                    "Рассылка новостей и специальных предложений (с согласия Пользователя)"
                ],
                "8": "4.9. Соблюдение законодательства:",
                "8_list": [
                    "Выполнение требований налогового и бухгалтерского учета",
                    "Предоставление информации государственным органам по запросу",
                    "Защита прав и законных интересов Оператора"
                ]
            },
            "grounds": {
                "title": "5. ПРАВОВЫЕ ОСНОВАНИЯ ОБРАБОТКИ ПЕРСОНАЛЬНЫХ ДАННЫХ",
                "intro": "5.1. Правовыми основаниями обработки персональных данных являются:",
                "1": "5.2. Согласие субъекта персональных данных на обработку его персональных данных, предоставленное путем акцепта настоящей Политики при регистрации в Приложении.",
                "2": "5.3. Необходимость исполнения договора, стороной которого является субъект персональных данных (Публичная оферта на оказание услуг по предоставлению доступа к Платформе).",
                "3": "5.4. Необходимость для осуществления прав и законных интересов Оператора или третьих лиц (обеспечение безопасности, предотвращение мошенничества).",
                "4": "5.5. Необходимость для выполнения обязанностей, предусмотренных законодательством Республики Узбекистан (финансовая отчетность, требования государственных органов)."
            },
            "methods": {
                "title": "6. СПОСОБЫ И СРОКИ ОБРАБОТКИ ПЕРСОНАЛЬНЫХ ДАННЫХ",
                "1": "6.1. Обработка персональных данных осуществляется с использованием средств автоматизации и без использования средств автоматизации.",
                "2": "6.2. Мы обрабатываем персональные данные в течение срока, необходимого для достижения целей обработки, указанных в разделе 4 настоящей Политики, если иное не предусмотрено законодательством.",
                "3": "6.3. Сроки хранения персональных данных:",
                "3_list": [
                    "Данные активных Пользователей (имя, фамилия, номер телефона) хранятся до момента удаления учетной записи Пользователем или блокировки учетной записи Оператором.",
                    "Документы Водителей (водительское удостоверение, технический паспорт) хранятся в течение всего периода использования Водителем Приложения и в течение 3 (трех) лет после удаления или блокировки учетной записи.",
                    "История поездок и финансовые транзакции хранятся в течение 5 (пяти) лет для целей бухгалтерского учета и соблюдения налогового законодательства.",
                    "Сообщения во встроенном чате хранятся в течение 1 (одного) года с момента отправки или до удаления учетной записи Пользователем.",
                    "Данные геолокации хранятся в течение 90 (девяноста) дней с момента завершения поездки.",
                    "Техническая информация (IP-адрес, данные устройства, cookies) хранится в течение 6 (шести) месяцев."
                ],
                "4": "6.4. По истечении сроков хранения персональные данные подлежат удалению или обезличиванию, если иное не предусмотрено законодательством Республики Узбекистан.",
                "5": "6.5. В случае удаления Пользователем учетной записи, его персональные данные удаляются в течение 30 (тридцати) календарных дней, за исключением данных, которые должны храниться в соответствии с требованиями законодательства (финансовые транзакции, документы для бухгалтерского учета)."
            },
            "transfer": {
                "title": "7. ПЕРЕДАЧА ПЕРСОНАЛЬНЫХ ДАННЫХ ТРЕТЬИМ ЛИЦАМ",
                "1": "7.1. Мы не продаем, не обмениваем и не передаем персональные данные Пользователей третьим лицам без согласия Пользователя, за исключением случаев, предусмотренных настоящей Политикой и законодательством Республики Узбекистан.",
                "2": "7.2. Персональные данные могут быть переданы третьим лицам в следующих случаях:",
                "2_1": "Другим Пользователям Приложения:",
                "2_1_list": [
                    "Пассажирам отображается информация о Водителе (имя, фамилия, фотография профиля, рейтинг, марка и модель автомобиля, государственный номер) при просмотре поездки.",
                    "Водителям отображается информация о Пассажирах (имя, фамилия, фотография профиля, рейтинг) после бронирования поездки.",
                    "Передача осуществляется только в объеме, необходимом для организации поездки."
                ],
                "2_2": "Поставщикам услуг и подрядчикам:",
                "2_2_desc": "Мы можем передавать персональные данные организациям, которые предоставляют услуги от нашего имени:",
                "2_2_list": [
                    "Хостинг-провайдерам для размещения данных на серверах",
                    "Платежным системам для обработки финансовых операций",
                    "Провайдерам SMS-рассылок для отправки OTP-кодов и уведомлений",
                    "Сервисам аналитики для анализа использования Приложения",
                    "Службам технической поддержки",
                    "Все такие третьи лица обязаны обеспечивать конфиденциальность и безопасность персональных данных в соответствии с договорами, заключенными с Оператором."
                ],
                "2_3": "Государственным органам и правоохранительным органам:",
                "2_3_desc": "В соответствии с законодательством Республики Узбекистан на основании официального запроса компетентных органов (суд, прокуратура, полиция, налоговые органы и др.).",
                "2_4": "При реорганизации или продаже бизнеса:",
                "2_4_desc": "В случае слияния, поглощения, реорганизации или продажи активов Оператора персональные данные могут быть переданы правопреемнику или приобретателю при условии соблюдения ими настоящей Политики.",
                "3": "7.3. Мы не осуществляем трансграничную передачу персональных данных без соблюдения требований законодательства Республики Узбекистан о персональных данных.",
                "4": "7.4. При расширении деятельности на территории других государств Оператор будет соблюдать требования законодательства о защите персональных данных соответствующих стран."
            },
            "protection": {
                "title": "8. ЗАЩИТА ПЕРСОНАЛЬНЫХ ДАННЫХ",
                "1": "8.1. Оператор принимает необходимые правовые, организационные и технические меры для защиты персональных данных от неправомерного или случайного доступа, уничтожения, изменения, блокирования, копирования, предоставления, распространения, а также от иных неправомерных действий.",
                "2": "8.2. Технические меры защиты:",
                "2_list": [
                    "Шифрование персональных данных при передаче (SSL/TLS)",
                    "Шифрование персональных данных при хранении в базах данных",
                    "Использование защищенных серверов с ограниченным доступом",
                    "Регулярное резервное копирование данных",
                    "Защита от несанкционированного доступа (межсетевые экраны, системы обнаружения вторжений)",
                    "Антивирусная защита",
                    "Многоуровневая аутентификация для административного доступа"
                ],
                "3": "8.3. Организационные меры защиты:",
                "3_list": [
                    "Назначение ответственного за организацию обработки персональных данных",
                    "Разграничение прав доступа сотрудников к персональным данным",
                    "Обучение сотрудников правилам обработки и защиты персональных данных",
                    "Заключение соглашений о конфиденциальности с сотрудниками",
                    "Контроль соблюдения требований законодательства о персональных данных",
                    "Проведение внутренних аудитов системы защиты персональных данных"
                ],
                "4": "8.4. Доступ к персональным данным имеют только уполномоченные сотрудники Оператора и подрядчики, которым эта информация необходима для выполнения служебных обязанностей.",
                "5": "8.5. Несмотря на применение всех необходимых мер безопасности, мы не можем гарантировать абсолютную защиту персональных данных от всех возможных угроз, учитывая технические ограничения сети Интернет.",
                "6": "8.6. Пользователь несет ответственность за сохранение конфиденциальности своих учетных данных (номер телефона, OTP-код). Любые действия, совершенные с использованием учетной записи Пользователя, считаются совершенными самим Пользователем.",
                "7": "8.7. В случае обнаружения инцидента, связанного с нарушением безопасности персональных данных, Оператор обязуется уведомить затронутых Пользователей и уполномоченный государственный орган в сроки, установленные законодательством."
            },
            "rights": {
                "title": "9. ПРАВА СУБЪЕКТОВ ПЕРСОНАЛЬНЫХ ДАННЫХ",
                "1": "9.1. В соответствии с законодательством Республики Узбекистан Пользователи имеют следующие права в отношении своих персональных данных:",
                "1_1": "1) Право на доступ: Пользователь имеет право получить информацию о том, обрабатываются ли его персональные данные, и получить доступ к таким персональным данным.",
                "1_2": "2) Право на уточнение: Пользователь имеет право требовать исправления неточных или неполных персональных данных.",
                "1_3": "3) Право на удаление: Пользователь имеет право требовать удаления своих персональных данных в случаях, когда:",
                "1_3_list": [
                    "персональные данные больше не нужны для целей, для которых они собирались;",
                    "Пользователь отзывает согласие на обработку персональных данных;",
                    "персональные данные обрабатывались неправомерно;",
                    "удаление необходимо для выполнения требований законодательства."
                ],
                "1_4": "4) Право на ограничение обработки: Пользователь имеет право требовать ограничения обработки персональных данных в случаях, когда:",
                "1_4_list": [
                    "оспаривается точность персональных данных;",
                    "обработка является незаконной, но Пользователь не хочет удаления данных;",
                    "персональные данные больше не нужны Оператору, но нужны Пользователю для защиты его прав."
                ],
                "1_5": "5) Право на отзыв согласия: Пользователь имеет право в любое время отозвать свое согласие на обработку персональных данных путем удаления учетной записи в Приложении.",
                "1_6": "6) Право на подачу жалобы: Пользователь имеет право подать жалобу в уполномоченный государственный орган по защите прав субъектов персональных данных.",
                "2": "9.2. Для реализации своих прав Пользователь может:",
                "2_list": [
                    "Использовать настройки учетной записи в Приложении для обновления или удаления информации.",
                    "Обратиться в службу поддержки через функционал Приложения или по контактам, указанным в разделе 14 настоящей Политики."
                ],
                "3": "9.3. Оператор обязуется рассмотреть запрос Пользователя и предоставить ответ в течение 30 (тридцати) календарных дней с момента получения запроса.",
                "4": "9.4. Оператор вправе отказать в удалении персональных данных, если их хранение предусмотрено законодательством Республики Узбекистан (например, финансовые транзакции для целей бухгалтерского учета)."
            },
            "cookies": {
                "title": "10. COOKIES И ТЕХНОЛОГИИ ОТСЛЕЖИВАНИЯ",
                "1": "10.1. Приложение Yo'ldosh использует cookies и аналогичные технологии отслеживания для улучшения пользовательского опыта и анализа использования Приложения.",
                "2": "10.2. Cookies – это небольшие текстовые файлы, которые сохраняются на устройстве Пользователя и позволяют Приложению запоминать информацию о действиях и предпочтениях Пользователя.",
                "3": "10.3. Мы используем следующие типы cookies:",
                "3_1": "1) Необходимые cookies: Обеспечивают базовую функциональность Приложения (авторизация, безопасность). Эти cookies необходимы для работы Приложения и не могут быть отключены.",
                "3_2": "2) Функциональные cookies: Позволяют Приложению запоминать выбор Пользователя (язык интерфейса, настройки отображения).",
                "3_3": "3) Аналитические cookies: Собирают информацию о том, как Пользователи используют Приложение, что позволяет нам улучшать его работу (Google Analytics, Firebase Analytics и другие).",
                "3_4": "4) Рекламные cookies: Используются для показа релевантной рекламы и оценки эффективности рекламных кампаний (в настоящее время не используются, но могут быть внедрены в будущем).",
                "4": "10.4. Пользователь может управлять cookies через настройки своего устройства или браузера. Однако отключение необходимых cookies может повлиять на функциональность Приложения.",
                "5": "10.5. Помимо cookies, мы используем следующие технологии:",
                "5_list": [
                    "Пиксели отслеживания (tracking pixels) для анализа эффективности email-рассылок (если применимо).",
                    "SDK третьих сторон для аналитики и отслеживания ошибок (Firebase, Crashlytics и др.).",
                    "Уникальные идентификаторы устройств для идентификации Пользователей на разных сессиях."
                ]
            },
            "minors": {
                "title": "11. ОСОБЕННОСТИ ОБРАБОТКИ ДАННЫХ НЕСОВЕРШЕННОЛЕТНИХ",
                "1": "11.1. Приложение Yo'ldosh предназначено для лиц, достигших 18 (восемнадцати) лет.",
                "2": "11.2. Мы не собираем преднамеренно персональные данные лиц младше 18 лет.",
                "3": "11.3. Если Оператору станет известно, что персональные данные были собраны от лица младше 18 лет без согласия родителей или законных представителей, такие данные будут незамедлительно удалены.",
                "4": "11.4. Если вы считаете, что мы могли получить персональные данные от лица младше 18 лет, пожалуйста, свяжитесь с нами по контактам, указанным в разделе 14 настоящей Политики."
            },
            "changes": {
                "title": "12. ИЗМЕНЕНИЯ В ПОЛИТИКЕ КОНФИДЕНЦИАЛЬНОСТИ",
                "1": "12.1. Оператор оставляет за собой право вносить изменения в настоящую Политику в любое время.",
                "2": "12.2. Новая редакция Политики вступает в силу с момента ее размещения в Приложении, если иное не предусмотрено новой редакцией Политики.",
                "3": "12.3. О существенных изменениях в Политике (изменение целей обработки, передача данных новым третьим лицам, изменение сроков хранения) Пользователи будут уведомлены через Приложение (push-уведомление, сообщение в Приложении) не менее чем за 7 (семь) календарных дней до вступления изменений в силу.",
                "4": "12.4. Действующая редакция Политики всегда доступна в Приложении в разделе настроек и по адресу: [указать веб-сайт, если есть].",
                "5": "12.5. Продолжение использования Приложения после вступления в силу новой редакции Политики означает согласие Пользователя с внесенными изменениями.",
                "6": "12.6. Дата последнего обновления Политики указывается в начале документа."
            },
            "law": {
                "title": "13. ПРИМЕНИМОЕ ЗАКОНОДАТЕЛЬСТВО",
                "1": "13.1. Настоящая Политика и все связанные с ней вопросы регулируются законодательством Республики Узбекистан.",
                "2": "13.2. Все споры, возникающие в связи с обработкой персональных данных, разрешаются в соответствии с законодательством Республики Узбекистан.",
                "3": "13.3. До обращения в суд обязательно соблюдение претензионного порядка. Срок рассмотрения претензии – 10 (десять) календарных дней."
            },
            "contact": {
                "title": "14. КОНТАКТНАЯ ИНФОРМАЦИЯ",
                "1": "14.1. Если у вас есть вопросы, комментарии или запросы относительно настоящей Политики или обработки ваших персональных данных, вы можете связаться с нами следующими способами:",
                "company": "ООО \"MILLIY YOLDOSH\"",
                "address": "Юридический адрес: Ташкентская область, Кибрайский район, Фаровон МФЙ, БУШ \"НУРАФШОН-2\" кучаси, 3-уй",
                "email": "Общая электронная почта: info@yoldosh.uz",
                "phone": "Телефон службы поддержки: +998 (94) 000-12-58",
                "telegram": "Telegram: @yoldosh_admin",
                "workHours": "Время работы службы поддержки: 11:00-20:00",
                "2": "14.2. Мы обязуемся ответить на ваш запрос в течение 10 (десяти) календарных дней с момента его получения.",
                "3": "14.3. Для защиты вашей конфиденциальности при обработке запросов мы можем запросить у вас дополнительную информацию для подтверждения вашей личности."
            },
            "final": {
                "title": "15. ЗАКЛЮЧИТЕЛЬНЫЕ ПОЛОЖЕНИЯ",
                "1": "15.1. Настоящая Политика является неотъемлемой частью Публичной оферты на оказание услуг по предоставлению доступа к Платформе Yo'ldosh.",
                "2": "15.2. Если какое-либо положение настоящей Политики будет признано недействительным, это не влечет недействительности остальных положений.",
                "3": "15.3. Настоящая Политика составлена на русском и узбекском языках. В случае расхождений приоритет имеет версия на узбекском языке.",
                "4": "15.4. Принимая условия настоящей Политики, Пользователь подтверждает, что:",
                "4_list": [
                    "ознакомился с текстом Политики полностью;",
                    "понимает свои права и обязанности;",
                    "дает согласие на обработку своих персональных данных в целях и на условиях, определенных настоящей Политикой;",
                    "обязуется соблюдать конфиденциальность учетных данных своей учетной записи."
                ],
                "date": "Дата публикации: 13.01.2026",
                "version": "Версия: 1.0",
                "director": "Директор ООО \"MILLIY YOLDOSH\" Ханапияев Б.Ф."
            }
        },
        "DeleteAccount": {
            "title": "Удаление аккаунта",
            "deleting": "Удаляем ваш аккаунт...",
            "success": "Аккаунт успешно удалён",
            "successDefault": "Операция выполнена успешно",
            "error": "Не удалось удалить аккаунт",
            "missingParams": "Отсутствуют обязательные параметры в ссылке",
            "invalidPhone": "Неверный формат номера телефона",
            "invalidToken": "Ссылка недействительна или повреждена",
            "somethingWentWrong": "Что-то пошло не так",
            "contactSupport": "Если проблема сохраняется — напишите в поддержку",
            "redirectIn": "Перенаправление через",
            "seconds": "сек",
            "locale": "ru"
        }
    },
    "Components": {
        "Header": {
            "Home": "Главная",
            "About": "О нас",
            "Trips": "Поездки",
            "DownloadApp": "Скачать"
        },
        "Search": {
            "From": "Откуда",
            "To": "Куда",
            "FromCityPlaceholder": "Ташкент",
            "ToCityPlaceholder": "Андижан",
            "Passengers": {
                "Title": "Пассажиры",
                "1": "1 пассажир",
                "2": "2 пассажира",
                "3": "3 пассажира",
                "4": "4 пассажира",
                "5": "5 пассажиров",
                "6": "6 пассажиров"
            },
            "Search": "Найти",
            "Filters": "Фильтры",
            "SortBy": "Сортировать по",
            "Sort": {
                "Default": "По умолчанию (лучшее совпадение)",
                "Price": "Цена",
                "Date": "Дата отправления",
                "Distance": "Расстояние"
            },
            "Order": "Порядок",
            "Ascending": "По возрастанию",
            "Descending": "По убыванию",
            "DriverPreferences": "Предпочтения водителя",
            "PassengerPreferences": "Ваши предпочтения",
            "Preferences": {
                "Smoking": "Разрешено курить",
                "Pets": "Можно с животными",
                "Music": "Музыка",
                "Talkative": "Разговорчивый водитель",
                "AC": "Кондиционер",
                "Any": "Любое",
                "Empty": "Пустой",
                "HalfEmpty": "Полупустой",
                "Full": "Полный"
            },
            "Any": "Любое",
            "Yes": "Да",
            "No": "Нет",
            "ResetFilters": "Сбросить фильтры"
        },
        "Calendar": "dd.mm.yyyy",
        "Footer": {
            "Product": {
                "Title": "Продукт",
                "1": "Для пассажиров",
                "2": "Для водителей",
                "3": "Цены"
            },
            "Company": {
                "Title": "Компания",
                "1": "О нас",
                "2": "Карьера",
                "3": "Блог"
            },
            "Support": {
                "Title": "Поддержка",
                "1": "Помощь",
                "2": "Контакты",
                "3": "Политика конфиденциальности",
                "4": "Публичная офферта"
            },
            "Rights": "Все права защищены"
        }
    },
    "metadata": {
        "home": {
            "title": "Yoldosh — совместные поездки по Узбекистану",
            "description": "Найдите попутчиков для поездок по Узбекистану. Ташкент–Самарканд, Ташкент–Бухара, Ташкент–Фергана и другие маршруты. Безопасный карпулинг.",
            "keywords": [
                "попутчики Узбекистан",
                "карпулинг Узбекистан",
                "совместные поездки",
                "Ташкент Самарканд попутчик",
                "Ташкент Бухара попутчик",
                "Ташкент Фергана попутчик",
                "Ташкент Андижан попутчик",
                "Ташкент Наманган попутчик",
                "Самарканд Бухара попутчик",
                "попутчики межгород Узбекистан",
                "карпулинг Ташкент",
                "поездки по Узбекистану дешево"
            ],
            "og": {
                "title": "Yoldosh — совместные поездки по Узбекистану",
                "description": "Экономьте на поездках с проверенными водителями. Ташкент, Самарканд, Бухара, Фергана и другие города.",
                "image": "/og-home-ru.png"
            }
        },
        "about": {
            "title": "О нас — Yoldosh | Карпулинг в Узбекистане",
            "description": "Yoldosh — ведущий сервис совместных поездок по Узбекистану. Наша миссия: сделать межгородские поездки доступными, безопасными и экологичными.",
            "keywords": [
                "о компании Yoldosh",
                "карпулинг Узбекистан",
                "миссия Yoldosh",
                "совместные поездки Узбекистан",
                "попутчики приложение Узбекистан"
            ],
            "og": {
                "title": "О компании Yoldosh — карпулинг в Узбекистане",
                "description": "Yoldosh — ведущий сервис карпулинга. Проверенные водители, честные цены.",
                "image": "/og-about-ru.png"
            }
        },
        "trips": {
            "title": "Поиск поездок по Узбекистану — Yoldosh",
            "description": "Ищите попутчиков на маршрутах Ташкент–Самарканд, Ташкент–Бухара, Ташкент–Фергана, Андижан–Ташкент и тысячи других. Ежедневные рейсы.",
            "keywords": [
                "поиск поездок Узбекистан",
                "попутчики",
                "карпулинг Узбекистан",
                "Ташкент Самарканд цена поездки",
                "Ташкент Бухара карпулинг",
                "Ташкент Фергана попутчик",
                "Андижан Ташкент попутчик",
                "Наманган Ташкент совместная поездка",
                "Самарканд Бухара маршрут",
                "межгород попутчики Узбекистан",
                "дешевые поездки Узбекистан"
            ],
            "og": {
                "title": "Найти попутчика по Узбекистану — Yoldosh",
                "description": "Тысячи маршрутов ежедневно. Ташкент, Самарканд, Бухара, Фергана и весь Узбекистан.",
                "image": "/og-trips-ru.png"
            }
        },
        "publicOffer": {
            "title": "Публичная оферта — Yoldosh",
            "description": "Официальные условия использования платформы совместных поездок Yoldosh.",
            "keywords": [
                "публичная оферта Yoldosh",
                "условия использования"
            ],
            "og": {
                "title": "Публичная оферта Yoldosh",
                "description": "Юридическая информация и условия использования сервиса.",
                "image": "/og-offer-ru.png"
            }
        },
        "privacyPolicy": {
            "title": "Политика конфиденциальности — Yoldosh",
            "description": "Официальная политика конфиденциальности платформы совместных поездок Yoldosh.",
            "keywords": [
                "политика конфиденциальности Yoldosh",
                "персональные данные Yoldosh"
            ],
            "og": {
                "title": "Политика конфиденциальности Yoldosh",
                "description": "Юридическая информация о защите персональных данных.",
                "image": "/og-offer-ru.png"
            }
        }
    },
    "manifest": {
        "name": "Yoldosh — совместные поездки",
        "shortName": "Yoldosh",
        "description": "Безопасный сервис совместных поездок по Узбекистану"
    }
}